Conf.Simple/src/Documents/SUI_ДокументОбмена/SUI_ДокументОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SUI_ДокументОбмена</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.SUI_ДополнительныеРеквизитыДокументовОбмена</registerRecords>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОснования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.SUI_ТипыДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецСостояния</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Conf.Simple/src/InformationRegisters/SUI_ГрупповойПересчет/SUI_ГрупповойПересчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ГрупповойПересчет</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОбмена</name>
    <type>
      <types>DocumentRef.SUI_ДокументОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ПотокШтрихкодов/SUI_ПотокШтрихкодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ПотокШтрихкодов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОбмена</name>
    <type>
      <types>DocumentRef.SUI_ДокументОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ДополнительныеРеквизитыДокументовОбмена/SUI_ДополнительныеРеквизитыДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ДополнительныеРеквизитыДокументовОбмена</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОбмена</name>
    <type>
      <types>DocumentRef.SUI_ДокументОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Таблица</name>
    <type>
      <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <comment>Уникальный идентификатор строки</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_СтатусыОбработкиСтрок/SUI_СтатусыОбработкиСтрок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СтатусыОбработкиСтрок</name>
  <enumValues>
    <name>ТребуетсяОбработка</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаНеВыполнена</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаНеТребуется</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_СостоянияДокументовОбмена/SUI_СостоянияДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияДокументовОбмена</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>КВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Загружен</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТипыДокументовОбмена/SUI_ТипыДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыДокументовОбмена</name>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>АдресноеХранениеОтбор</name>
  </enumValues>
  <enumValues>
    <name>АдресноеХранениеРазмещение</name>
  </enumValues>
  <enumValues>
    <name>СборШтрихкодов</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Documents/SUI_ДокументОбмена/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначенияДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияДанныеЗаполнения = Тип("Структура") И 
		ДанныеЗаполнения.Свойство("ДокументОснование") И 
		ДанныеЗаполнения.Свойство("НастройкаДокумента") Тогда
		
		ЗаполнитьДокументОбменаПоДокументуИНастройке(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗначенияДанныеЗаполнения = Тип("ОбъектXDTO") Тогда
		ЗаполнитьДокументОбменаПриОбмене(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Отказ Или ДополнительныеСвойства.Свойство("SUI_ОтключитьОбработчики") Тогда
		Возврат;
	КонецЕсли;
	
	НеПроверяемыеРеквизиты = Новый Массив();
	
	НеПроверяемыеРеквизиты.Добавить("ДокументОснование");
	
	ПроверитьЗаполнениеДокументОснование(Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Отказ Или ДополнительныеСвойства.Свойство("SUI_ОтключитьОбработчики") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Документ.SUI_ДокументОбмена
		|ГДЕ
		|	Ссылка <> &Ссылка
		|	И ДокументОснование = &ДокументОснование
		|	И НастройкаДокумента = &НастройкаДокумента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбщегоНазначенияКлиентСервер.Проверить(РезультатЗапроса.Пустой(), 
		НСтр("ru = 'По документу основания и настройке документа уже существует документ обмена'"));
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ЕстьДублиИдентификаторовСтрок(Товары),
		НСтр("ru = 'Идентификаторы строк табличной части Товары неуникальны'"));
	ОбщегоНазначенияКлиентСервер.Проверить(Не ЕстьДублиИдентификаторовСтрок(Серии),
		НСтр("ru = 'Идентификаторы строк табличной части Серии неуникальны'"));
	ОбщегоНазначенияКлиентСервер.Проверить(Не ЕстьДублиИдентификаторовСтрок(ШтрихкодыУпаковок),
		НСтр("ru = 'Идентификаторы строк табличной части Штрихкоды упаковок неуникальны'"));
	
	Если Не ЭтоНовый() Тогда
		ТипДокументаИзСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ТипДокумента");
		ОбщегоНазначенияКлиентСервер.Проверить(ТипДокумента = ТипДокументаИзСсылки,
			СтрШаблон(НСтр("ru = 'Смена типа документа в существующем документе обмена недопустима.
			|Текущий тип: %1
			|Новый тип: %2
			|Удалите документ обмена и выгрузите новый.'"), ТипДокументаИзСсылки, ТипДокумента));
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		
		Если ПолучитьФункциональнуюОпцию("SUI_РегистрироватьИзмененияПослеЗагрузкиДокументаОбмена") Тогда
			Документы.SUI_ДокументОбмена.ЗаполнитьПолучателейОбменаДанными(ЭтотОбъект);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	//
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ Или ДополнительныеСвойства.Свойство("SUI_ОтключитьОбработчики") Тогда
		Возврат;
	КонецЕсли;
	
	// Удалить загруженные записи группового пересчета
	Если ДополнительныеСвойства.Свойство("ЗагруженныеИдентификаторыГрупповогоПересчета") Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("ДокументОбмена", Ссылка);
		Отбор.Вставить("ИдентификаторЗаписи", ДополнительныеСвойства.ЗагруженныеИдентификаторыГрупповогоПересчета);
		РегистрыСведений.SUI_ГрупповойПересчет.УдалитьДанные(Отбор);
	КонецЕсли;
	
	// Удалить загруженные записи потока штрихкодов
	Если ДополнительныеСвойства.Свойство("ЗагруженныеИдентификаторыПотокаШтрихкодов") Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("ДокументОбмена", Ссылка);
		Отбор.Вставить("ИдентификаторЗаписи", ДополнительныеСвойства.ЗагруженныеИдентификаторыПотокаШтрихкодов);
		РегистрыСведений.SUI_ПотокШтрихкодов.УдалитьПоток(Отбор);
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Дополнительные реквизиты
	Если Движения.SUI_ДополнительныеРеквизитыДокументовОбмена.Записывать И Не ПометкаУдаления Тогда
		
		Движения_ДополнительныеРеквизиты = Движения.SUI_ДополнительныеРеквизитыДокументовОбмена.Выгрузить();
		Движения_ДополнительныеРеквизиты.Свернуть("ДокументОбмена,Таблица,ИдентификаторСтроки,КлючРеквизита,ЗначениеРеквизита");
		Движения_ДополнительныеРеквизиты.ЗаполнитьЗначения(Ссылка, "ДокументОбмена");
		Движения.SUI_ДополнительныеРеквизитыДокументовОбмена.Загрузить(Движения_ДополнительныеРеквизиты);
		
	Иначе
		Движения.SUI_ДополнительныеРеквизитыДокументовОбмена.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Или ДополнительныеСвойства.Свойство("SUI_ОтключитьОбработчики") Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьРегистрациюПриУдалении();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьГрупповойПересчет(ЗагруженныеИдентификаторы = Неопределено) Экспорт
	
	Загружено = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдентификаторЗаписи,
		|	ИдентификаторСтроки,
		|	Номенклатура,
		|	Характеристика,
		|	Упаковка,
		|	Серия,
		|	Ячейка,
		|	КоличествоФакт
		|ИЗ
		|	РегистрСведений.SUI_ГрупповойПересчет
		|ГДЕ
		|	ДокументОбмена = &ДокументОбмена
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.SUI_ГрупповойПересчет";
	
	Запрос.УстановитьПараметр("ДокументОбмена", Ссылка);
	
	Если ЗагруженныеИдентификаторы = Неопределено Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			НовыхСтрок = 0;
			
			Пока Выборка.Следующий() Цикл
				
				Если ЗагруженныеИдентификаторы = Неопределено Тогда
					
					НаборЗаписей = РегистрыСведений.SUI_ГрупповойПересчет.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ДокументОбмена.Установить(Ссылка);
					НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(Выборка.ИдентификаторЗаписи);
					НаборЗаписей.Отбор.ИдентификаторСтроки.Установить(Выборка.ИдентификаторСтроки);
					НаборЗаписей.Записать(Истина);
					
				ИначеЕсли ЗагруженныеИдентификаторы.НайтиПоЗначению(Выборка.ИдентификаторЗаписи) = Неопределено Тогда
					ЗагруженныеИдентификаторы.Добавить(Выборка.ИдентификаторЗаписи);
				КонецЕсли;
				
				СтрокаТовар = Товары.Найти(Выборка.ИдентификаторСтроки, "ИдентификаторСтроки");
				
				Если СтрокаТовар = Неопределено Тогда
					СтрокаТовар = Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТовар, Выборка);
					СтрокаТовар.СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется;
					НовыхСтрок = НовыхСтрок+1;
				Иначе
					СтрокаТовар.КоличествоФакт = СтрокаТовар.КоличествоФакт + Выборка.КоличествоФакт;
				КонецЕсли;
				
			КонецЦикла;
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Данные группового пересчета загружены.
			|Всего строк: %1
			|Новых строк: %2'"), Выборка.Количество(), НовыхСтрок));
			
			Загружено = Истина;
			
		КонецЕсли;
		
		Если ЗагруженныеИдентификаторы = Неопределено И ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		Если ЗагруженныеИдентификаторы = Неопределено И ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Загружено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьРегистрациюПриУдалении()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_ДокументОбменаИзменения.Узел
		|ИЗ
		|	Документ.SUI_ДокументОбмена.Изменения КАК SUI_ДокументОбменаИзменения
		|ГДЕ
		|	SUI_ДокументОбменаИзменения.Ссылка = &Ссылка
		|ДЛЯ ИЗМЕНЕНИЯ
		|	Документ.SUI_ДокументОбмена.Изменения";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.УдалитьРегистрациюИзменений(Выборка.Узел, Ссылка);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ДокументыОбменаКлиентСервер.ИмяСобытия(), , , Ссылка, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#Область ЗаполнениеДокумента

Процедура ЗаполнитьДокументОбменаПоДокументуИНастройке(ДанныеЗаполнения)
	
	ДокументОснование = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДанныеЗаполнения.ДокументОснование);
	НастройкаДокумента = ДанныеЗаполнения.НастройкаДокумента;
	
	// Данные настройки документа
	ДанныеНастройки = Справочники.SUI_НастройкиДокументовОбмена.СформироватьДанныеНастройки(НастройкаДокумента);
	ОбщегоНазначенияКлиентСервер.Проверить(ДанныеНастройки <> Неопределено, 
		СтрШаблон(НСтр("ru = 'Не удалось сформировать данные настройки документа обмена ""%1""'"), НастройкаДокумента));
	
	Движения.SUI_ДополнительныеРеквизитыДокументовОбмена.Записывать = Истина;
	ДанныеНастройки.Вставить("ЗаполнятьДополнительныеРеквизиты", ПолучитьФункциональнуюОпцию("SUI_ИспользоватьДополнительныеРеквизитыТаблиц"));
	
	Если ЭтоНовый() Тогда
		Дата = ТекущаяДатаСеанса();
		Документы.SUI_ДокументОбмена.СменитьСостояниеДокументаОбмена(ЭтотОбъект, ДанныеНастройки.СостояниеПоУмолчанию,
			ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел());
	Иначе
		Документы.SUI_ДокументОбмена.СменитьСостояниеДокументаОбмена(ЭтотОбъект, Перечисления.SUI_СостоянияДокументовОбмена.Новый,
			ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел());
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Состояние") Тогда
		Документы.SUI_ДокументОбмена.СменитьСостояниеДокументаОбмена(ЭтотОбъект, ДанныеЗаполнения.Состояние,
			ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел());
	КонецЕсли;
	
	ТипДокумента = ДанныеНастройки.ТипДокумента;
	
	// Установить ссылку документа основания в параметр схемы компоновки данных
	SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(ДанныеНастройки.СхемаКомпоновкиДанных, "Ссылка", , ДанныеЗаполнения.ДокументОснование, , Истина);
	
	// Получить реквизиты документа
	ЗаполнитьРеквизитыДокументаОбмена(ДанныеНастройки);
	
	// Заполнение табличных частей
	ЗаполнитьТабличныеЧасти(ДанныеНастройки);
	
	// Штрихкод документа
	ЗаполнитьШтрихкодДокумента();
	
КонецПроцедуры

Функция СтруктураИменРеквизитовИзКолонокТаблицыЗначений(КоллекцияКолонок, КоллекцияОсновныхРеквизитов, 
	ВсеОсновныеРеквизиты = Истина, ВернутьВМассивах = Ложь, Знач ИсключитьКолонки = "")
	
	Результат = Новый Структура();
	Результат.Вставить("Основные", Новый Массив());
	Результат.Вставить("Дополнительные", Новый Массив());
	
	Для Каждого Колонка Из КоллекцияКолонок Цикл
		
		Если КоллекцияОсновныхРеквизитов.Найти(Колонка.Имя) = Неопределено Тогда
			Результат.Дополнительные.Добавить(Колонка.Имя);
		Иначе
			Результат.Основные.Добавить(Колонка.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВсеОсновныеРеквизиты Тогда
		
		Для индекс = 0 По КоллекцияОсновныхРеквизитов.ВГраница() Цикл
			
			Если Результат.Основные.Найти(КоллекцияОсновныхРеквизитов[индекс]) = Неопределено Тогда
				Результат.Основные.Добавить(КоллекцияОсновныхРеквизитов[индекс]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИсключитьКолонки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьКолонки, , Истина, Истина);
	Результат.Основные = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Результат.Основные, ИсключитьКолонки);
	Результат.Дополнительные = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Результат.Дополнительные, ИсключитьКолонки);
	
	Если Не ВернутьВМассивах Тогда
		Результат.Вставить("Основные", СтрСоединить(Результат.Основные, ","));
		Результат.Вставить("Дополнительные", СтрСоединить(Результат.Дополнительные, ","));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьРеквизитыДокументаОбмена(ДанныеНастройки)
	
	ПараметрыКомпоновки = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыКомпоновки.СхемаКомпоновкиДанных = КомпоновкаДанныхСервер.СкопироватьСхемуКомпоновкиДанных(ДанныеНастройки.СхемаКомпоновкиДанных);
	ПараметрыКомпоновки.ВыполнятьВПривилегированномРежиме = Истина;
	ПараметрыКомпоновки.ВозможностьИспользованияВнешнихФункций = Истина;
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, ПараметрыКомпоновки.СхемаКомпоновкиДанных,
		ДанныеНастройки.РеквизитыДокумента.НастройкиКомпоновки, СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	
	ПараметрыКомпоновки.НастройкиКомпоновкиДанных = Компоновщик.ПолучитьНастройки();
	
	ДобавитьВычисляемыеПоляИдентификатораSimple(ПараметрыКомпоновки.СхемаКомпоновкиДанных, 
		ПараметрыКомпоновки.НастройкиКомпоновкиДанных);
	
	Результат = Документы.SUI_ДокументОбмена.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыКомпоновки);
	
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураИменКолонок = СтруктураИменРеквизитовИзКолонокТаблицыЗначений(Результат.Колонки, 
		SUI_НастройкиДокументовКлиентСервер.ПолучитьИменаОсновныхРеквизитовТаблиц().ВыгрузитьЗначения());
	
	ОсновныеРеквизитыДокументаОбмена = Новый Структура(СтруктураИменКолонок.Основные);
	ЗаполнитьЗначенияСвойств(ОсновныеРеквизитыДокументаОбмена, Результат[0]);
	
	// Заполнить основные реквизиты в объекте документа обмена
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОсновныеРеквизитыДокументаОбмена);
	
	// Записать дополнительные реквизиты
	Если ДанныеНастройки.ЗаполнятьДополнительныеРеквизиты И Не ПустаяСтрока(СтруктураИменКолонок.Дополнительные) Тогда
		ТаблицаДополнительныхРеквизитов = Результат.Скопировать(, СтруктураИменКолонок.Дополнительные);
		ТаблицаДополнительныхРеквизитов.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("УникальныйИдентификатор"));
		ЗаполнитьДвиженияДополнительныхРеквизитов(ТаблицаДополнительныхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличныеЧасти(ДанныеНастройки)
	
	Для Каждого НастройкаТаблицы Из ДанныеНастройки.НастройкиТаблиц Цикл
		
		Если Не ЗначениеЗаполнено(НастройкаТаблицы.Значение.РеквизитыИдентификации) Или
			НастройкаТаблицы.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыКомпоновки = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
		ПараметрыКомпоновки.СхемаКомпоновкиДанных = SUI_КомпоновкаДанныхСервер.СкопироватьСхемуКомпоновкиДанных(ДанныеНастройки.СхемаКомпоновкиДанных);
		ПараметрыКомпоновки.ВыполнятьВПривилегированномРежиме = Истина;
		ПараметрыКомпоновки.ВозможностьИспользованияВнешнихФункций = Истина;
		
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, ПараметрыКомпоновки.СхемаКомпоновкиДанных,
			НастройкаТаблицы.Значение.НастройкиКомпоновки, СпособВосстановленияНастроекКомпоновкиДанных.Полное);
			
		ПараметрыКомпоновки.НастройкиКомпоновкиДанных = Компоновщик.ПолучитьНастройки();
			
		РеквизитыИдентификацииСтрок = НастройкаТаблицы.Значение.ИмяТабличнойЧасти + "." 
			+ СтрСоединить(НастройкаТаблицы.Значение.РеквизитыИдентификации, "," + НастройкаТаблицы.Значение.ИмяТабличнойЧасти + ".");
		
		// Ключ связи
		ВП_ИдентификацияСтрок = SUI_КомпоновкаДанныхСервер.ДобавитьВычисляемоеПоле(ПараметрыКомпоновки.СхемаКомпоновкиДанных, 
			"SUI_КлючСвязи", 
			"Документы.SUI_ДокументОбмена.ВычислитьКлючСвязи(" + РеквизитыИдентификацииСтрок + ")", 
			"КлючСвязи");
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(ПараметрыКомпоновки.НастройкиКомпоновкиДанных, 
			ВП_ИдентификацияСтрок.ПутьКДанным, ВП_ИдентификацияСтрок.Заголовок);
		
		ДобавитьВычисляемыеПоляИдентификатораSimple(ПараметрыКомпоновки.СхемаКомпоновкиДанных, 
			ПараметрыКомпоновки.НастройкиКомпоновкиДанных, НастройкаТаблицы.Ключ);
		
		ОжидаемыеКолонки = Документы.SUI_ДокументОбмена.ТаблицаЗначенийПоТипуТаблицы(НастройкаТаблицы.Ключ);
		
		Результат = Документы.SUI_ДокументОбмена.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыКомпоновки, ОжидаемыеКолонки);
		
		Если НастройкаТаблицы.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
			ЗаполнитьТабличнуюЧасть(Товары, Результат, , "КоличествоФакт,Ячейка");
		ИначеЕсли НастройкаТаблицы.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Тогда
			ЗаполнитьТабличнуюЧасть(Товары, Результат, , "КоличествоФакт,ВидЦены,Цена");
		ИначеЕсли НастройкаТаблицы.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
			ЗаполнитьТабличнуюЧасть(Товары, Результат, , "КоличествоФакт,ВидЦены,Цена");
		ИначеЕсли НастройкаТаблицы.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
			ЗаполнитьТабличнуюЧасть(Серии, Результат);
		ИначеЕсли НастройкаТаблицы.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
			ЗаполнитьТабличнуюЧасть(ШтрихкодыУпаковок, Результат);
		КонецЕсли;
		
		КолонкиТабличнойЧасти = Новый Массив();
		Для Каждого Колонка Из ОжидаемыеКолонки.Колонки Цикл
			КолонкиТабличнойЧасти.Добавить(Колонка.Имя);
		КонецЦикла;
		
		СтруктураИменКолонок = СтруктураИменРеквизитовИзКолонокТаблицыЗначений(Результат.Колонки, КолонкиТабличнойЧасти, , Истина);
		
		// Записать дополнительные реквизиты
		Если ДанныеНастройки.ЗаполнятьДополнительныеРеквизиты И СтруктураИменКолонок.Дополнительные.Количество() > 0 Тогда
			
			КолонкиКопирования = "ИдентификаторСтроки," + СтрСоединить(СтруктураИменКолонок.Дополнительные, ",");
			
			Если НастройкаТаблицы.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
				НастройкаТаблицы.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
				ТаблицаДопРеквизитов = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
			Иначе
				ТаблицаДопРеквизитов = НастройкаТаблицы.Ключ;
			КонецЕсли;
			
			ЗаполнитьДвиженияДополнительныхРеквизитов(Результат.Скопировать(, КолонкиКопирования), ТаблицаДопРеквизитов);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть(Приемник, Источник, Знач СписокСвойств = Неопределено, Знач ИсключаяСвойства = Неопределено)
	
	Если ИсключаяСвойства = Неопределено Тогда
		ИсключаяСвойства = "ИдентификаторСтроки,СтатусОбработки";
	Иначе
		ИсключаяСвойства = "ИдентификаторСтроки,СтатусОбработки," + ИсключаяСвойства;
	КонецЕсли;
	
	Для Каждого СтрокаИсточник Из Источник Цикл
		
		СтрокаПриемник = Приемник.Найти(СтрокаИсточник.КлючСвязи, "КлючСвязи");
		
		Если СтрокаПриемник = Неопределено Тогда
			СтрокаИсточник.ИдентификаторСтроки = SUI_ДокументыОбменаКлиентСервер
				.СформироватьИдентификаторСтрокиТабличнойЧастиДокументаОбмена(Приемник);
			СтрокаПриемник = Приемник.Добавить();
			СтрокаПриемник.ИдентификаторСтроки = СтрокаИсточник.ИдентификаторСтроки;
			СтрокаПриемник.СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется;
		Иначе
			СтрокаИсточник.ИдентификаторСтроки = СтрокаПриемник.ИдентификаторСтроки;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник, СписокСвойств, ИсключаяСвойства);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьВычисляемыеПоляИдентификатораSimple(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ТипТаблицы = Неопределено)
	
	РеквизитыИдентификаторов = РеквизитыИдентификаторовSimple(ТипТаблицы);
	
	ПутиКДанным = Новый Массив();
	
	Для Каждого ЭлементВыбора Из НастройкиКомпоновкиДанных.Выбор.Элементы Цикл
		
		Если РеквизитыИдентификаторов.Найти(ЭлементВыбора.Заголовок) = Неопределено Или Не ЭлементВыбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		ДоступноеПолеВыбора = НастройкиКомпоновкиДанных.Выбор.ДоступныеПоляВыбора.НайтиПоле(ЭлементВыбора.Поле);
		
		Если ДоступноеПолеВыбора = Неопределено Или
			ДоступноеПолеВыбора.Папка Или
			Не SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ДоступноеПолеВыбора.ТипЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(Строка(ЭлементВыбора.Поле), "ПользовательскиеПоля.Поле") Тогда
			
			ИдентификаторОбъекта = НастройкиКомпоновкиДанных.Выбор.ДоступныеПоляВыбора.ПолучитьИдентификаторПоОбъекту(
				ДоступноеПолеВыбора);
			
			Если ИдентификаторОбъекта = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПользовательскоеПоле = НастройкиКомпоновкиДанных.ПользовательскиеПоля.ПолучитьОбъектПоИдентификатору(
				ИдентификаторОбъекта);
			
			Если ПользовательскоеПоле = Неопределено Или Не ПользовательскоеПоле.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ЭлементВарианта Из ПользовательскоеПоле.Варианты.Элементы Цикл
				
				Если Не ЭлементВарианта.Использование Или 
					ПутиКДанным.Найти(Строка(ЭлементВарианта.Значение)) <> Неопределено Или 
					ТипЗнч(ЭлементВарианта.Значение) <> Тип("ПолеКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				ДоступноеПолеВарианта = ПользовательскоеПоле.Варианты.ДоступныеПоляЗначений.НайтиПоле(ЭлементВарианта.Значение);
				
				Если ДоступноеПолеВарианта = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ДоступноеПолеВарианта.ТипЗначения) Тогда
					ПутиКДанным.Добавить(Строка(ЭлементВарианта.Значение));
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ПутиКДанным.Найти(Строка(ЭлементВыбора.Поле)) <> Неопределено Тогда
			ПутиКДанным.Добавить(Строка(ЭлементВыбора.Поле));
		КонецЕсли;
		
	КонецЦикла;
	
	ПутиКДанным = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПутиКДанным);
	
	Для индекс = 0 По ПутиКДанным.ВГраница() Цикл
		
		Если СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти(ПутиКДанным[индекс]) = Неопределено Тогда
			SUI_КомпоновкаДанныхСервер.ДобавитьВычисляемоеПоле(СхемаКомпоновкиДанных, 
				ПутиКДанным[индекс], "SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(" + ПутиКДанным[индекс] + ")");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РеквизитыИдентификаторовSimple(ТипТаблицы)
	
	РеквизитыИдентификаторов = Новый Массив();
	
	Если ТипТаблицы = Неопределено Тогда
		РеквизитыИдентификаторов.Добавить("Контрагент");
		РеквизитыИдентификаторов.Добавить("Склад");
	Иначе
		
		РеквизитыИдентификаторов.Добавить("Номенклатура");
		РеквизитыИдентификаторов.Добавить("Характеристика");
		
		Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
			РеквизитыИдентификаторов.Добавить("Серия");
		Иначе
			
			РеквизитыИдентификаторов.Добавить("Упаковка");
			
			Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
				РеквизитыИдентификаторов.Добавить("ШтрихкодУпаковки");
			Иначе
				
				Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
					ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
					РеквизитыИдентификаторов.Добавить("Ячейка");
				Иначе
					РеквизитыИдентификаторов.Добавить("ВидЦены");
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(РеквизитыИдентификаторов);
	
КонецФункции

Процедура ЗаполнитьШтрихкодДокумента()
	
	ДокументОснованиеСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ДокументОснование);
	
	Если ДокументОснованиеСсылка = Неопределено Или
		Не SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылкаДокумента(ДокументОснованиеСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Алгоритм = ПолучитьФункциональнуюОпцию("SUI_АлгоритмПолученияШтрихкодаДокумента");
	
	Если Не ПустаяСтрока(Алгоритм) Тогда
		
		ПараметрыАлгоритма = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(ДокументОснованиеСсылка, ШтрихкодДокумента);
		
		ПараметрыАлгоритма = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
			"Документы.SUI_ДокументОбмена.ВыполнитьАлгоритмПолученияШтрихкодаДокумента", 
			Алгоритм, 
			ПараметрыАлгоритма, 
			Истина);
		
		ШтрихкодДокумента = ПараметрыАлгоритма[ПараметрыАлгоритма.ВГраница()];
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияДополнительныхРеквизитов(ДополнительныеРеквизиты, ТипТаблицы = Неопределено)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДополнительныеРеквизиты Из ДополнительныеРеквизиты Цикл
		
		ИдентификаторСтроки = СтрокаДополнительныеРеквизиты.ИдентификаторСтроки;
		
		Для Каждого Элемент Из ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаДополнительныеРеквизиты) Цикл
			
			Если Элемент.Ключ = "ИдентификаторСтроки" Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.SUI_ДополнительныеРеквизитыДокументовОбмена.Добавить();
			Движение.ИдентификаторСтроки = ИдентификаторСтроки;
			Движение.Таблица = ТипТаблицы;
			Движение.КлючРеквизита = Элемент.Ключ;
			Движение.ЗначениеРеквизита = ОбщегоНазначения.ЗначениеВСтрокуXML(Элемент.Значение);
			
		КонецЦикла;
		
		Если ТипТаблицы = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокументаПриОбмене

Процедура ЗаполнитьДокументОбменаПриОбмене(ДанныеЗаполнения)
	
	Если Не ПустаяСтрока(ДанныеЗаполнения.comment) Тогда
		Комментарий = ДанныеЗаполнения.comment;
	КонецЕсли;
	
	Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Загружен;
	
	НастроенныеТаблицы = Справочники.SUI_НастройкиДокументовОбмена.ПолучитьДоступныеНастроенныеТипыТаблиц(НастройкаДокумента, ТипДокумента);
	
	// Загрузка: Товары (tbl_products)
	Если НастроенныеТаблицы.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары) <> Неопределено Или
		НастроенныеТаблицы.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор) <> Неопределено Или
		НастроенныеТаблицы.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) <> Неопределено Тогда
		
		Для Каждого ДанныеТовара Из ДанныеЗаполнения.tbl_products Цикл
			ДобавитьТоварВТабличнуюЧастьПриОбмене(ДанныеТовара);
		КонецЦикла;
		
	КонецЕсли;
	
	// Загрузка: Серии (tbl_series)
	Если НастроенныеТаблицы.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии) <> Неопределено Тогда
		
		//TODO: 22.08.2024 - artem - Сделать проверку по использованию ФО Серии
		
		Для Каждого ДанныеСерии Из ДанныеЗаполнения.tbl_series Цикл
			ДобавитьСериюВТабличнуюЧастьПриОбмене(ДанныеСерии);
		КонецЦикла;
		
		// Обработка строк по статусу Требуется обработка
		СтрокиКОбработке = Документы.SUI_ДокументОбмена.ПолучитьСтрокиКОбработке(Серии);
		Если СтрокиКОбработке.Количество() > 0 Тогда
			Документы.SUI_ДокументОбмена.ОбработатьСтрокиСерий(СтрокиКОбработке);
		КонецЕсли;
		
	КонецЕсли;
	
	// Загрузка: Штрихкоды упаковок (tbl_marks)
	Если НастроенныеТаблицы.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок) <> Неопределено Тогда
		
		//TODO: 22.08.2024 - artem - Сделать проверку по использованию ФО штрихкоды упаковок
		
		Для Каждого ДанныеШтрихкодаУпаковки Из ДанныеЗаполнения.tbl_marks Цикл
			ДобавитьШтрихкодУпаковкиВТабличнуюЧастьПриОбмене(ДанныеШтрихкодаУпаковки)
		КонецЦикла;
		
		// Обработка строк по статусу Требуется обработка
		СтрокиКОбработке = Документы.SUI_ДокументОбмена.ПолучитьСтрокиКОбработке(ШтрихкодыУпаковок);
		Если СтрокиКОбработке.Количество() > 0 Тогда
			Документы.SUI_ДокументОбмена.ОбработатьСтрокиШтрихкодовУпаковок(СтрокиКОбработке);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьТоварВТабличнуюЧастьПриОбмене(ДанныеТовара)
	
	ТекущаяСтрокаТЧ = Товары.Найти(ДанныеТовара.id, "ИдентификаторСтроки");
	
	Если ТекущаяСтрокаТЧ = Неопределено Тогда
		
		Если Не ДанныеТовара.is_new Тогда
			ШаблонСообщения = НСтр("ru = '[Товары] Строка с идентификатором %1 пропущена по причине: Не заполнен реквизит is_new.'");
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ДанныеТовара.id));
			Возврат Ложь;
		КонецЕсли;
		
		Если ДанныеТовара.product_id = Неопределено Тогда
			ШаблонСообщения = НСтр("ru = '[Товары] Строка с идентификатором %1 пропущена по причине: Не заполнен реквизит product_id.'");
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ДанныеТовара.id));
			Возврат Ложь;
		КонецЕсли;
		
		ТекущаяСтрокаТЧ = Товары.Добавить();
		
		ТекущаяСтрокаТЧ.ИдентификаторСтроки = ДанныеТовара.id;
		ТекущаяСтрокаТЧ.Номенклатура = ДанныеТовара.product_id;
		ТекущаяСтрокаТЧ.Характеристика = ДанныеТовара.property_id;
		ТекущаяСтрокаТЧ.Упаковка = ДанныеТовара.unit_id;
		
		Если ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор Или
			ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеРазмещение Тогда
			ТекущаяСтрокаТЧ.Ячейка = ДанныеТовара.cell_id;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущаяСтрокаТЧ.КоличествоФакт = ДанныеТовара.qty;
	
	// [21.08.2024] artem: Для товаров, отбора или размещения статус обработки всегда ОбработкаНеТребуется
	ТекущаяСтрокаТЧ.СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется;
	
	Возврат Истина;
	
КонецФункции

Функция ДобавитьСериюВТабличнуюЧастьПриОбмене(ДанныеСерии)
	
	СтрокаСерии = Серии.Найти(ДанныеСерии.id, "ИдентификаторСтроки");
	
	Если СтрокаСерии = Неопределено Тогда
		
		Если Не ДанныеСерии.is_new Тогда
			ШаблонСообщения = НСтр("ru = '[Серии] Строка с идентификатором %1 пропущена по причине: Не заполнен реквизит is_new.'");
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ДанныеСерии.id));
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаСерии = Серии.Добавить();
		СтрокаСерии.ИдентификаторСтроки = ДанныеСерии.id;
		
	КонецЕсли;
	
	СтрокаСерии.Номенклатура = ДанныеСерии.product_id;
	СтрокаСерии.Характеристика = ДанныеСерии.property_id;
	СтрокаСерии.Серия = ДанныеСерии.series_id;
	СтрокаСерии.Наименование = ДанныеСерии.name;
	СтрокаСерии.Номер = ДанныеСерии.number;
	СтрокаСерии.ДатаПроизводства = ДанныеСерии.production_date;
	СтрокаСерии.ГоденДо = ДанныеСерии.best_before;
	СтрокаСерии.КоличествоФакт = ДанныеСерии.qty;
	
	Если ЗначениеЗаполнено(СтрокаСерии.Серия) Тогда
		СтрокаСерии.СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется;
	Иначе
		СтрокаСерии.СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ТребуетсяОбработка;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ДобавитьШтрихкодУпаковкиВТабличнуюЧастьПриОбмене(ДанныеШтрихкодаУпаковки)
	
	СтрокаШтрихкодУпаковки = ШтрихкодыУпаковок.Найти(ДанныеШтрихкодаУпаковки.id, "ИдентификаторСтроки");
			
	Если СтрокаШтрихкодУпаковки = Неопределено Тогда
		
		Если Не ДанныеШтрихкодаУпаковки.is_new Тогда
			ШаблонСообщения = НСтр("ru = '[Штрихкоды упаковок] Строка с идентификатором %1 пропущена по причине: Не заполнен реквизит is_new.'");
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ДанныеШтрихкодаУпаковки.id));
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаШтрихкодУпаковки = ШтрихкодыУпаковок.Добавить();
		
	КонецЕсли;
	
	СтрокаШтрихкодУпаковки.ИдентификаторСтроки = ДанныеШтрихкодаУпаковки.id;
	СтрокаШтрихкодУпаковки.Номенклатура = ДанныеШтрихкодаУпаковки.product_id;
	СтрокаШтрихкодУпаковки.Характеристика = ДанныеШтрихкодаУпаковки.property_id;
	СтрокаШтрихкодУпаковки.Упаковка = ДанныеШтрихкодаУпаковки.unit_id;
	СтрокаШтрихкодУпаковки.ЗначениеШтрихкода = ДанныеШтрихкодаУпаковки.barcode_from_scanner;
	СтрокаШтрихкодУпаковки.ШтрихкодУпаковки = ДанныеШтрихкодаУпаковки.barcode_id;
	
	Если ЗначениеЗаполнено(СтрокаШтрихкодУпаковки.ШтрихкодУпаковки) Тогда
		СтрокаШтрихкодУпаковки.СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется;
	Иначе
		СтрокаШтрихкодУпаковки.СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ТребуетсяОбработка;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ПроверкаЗаполнения

Процедура ПроверитьЗаполнениеДокументОснование(Отказ)
	
	Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ДокументОснование) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутствует документ основание'"), , "Объект.ДокументОснование", , Отказ);
	Иначе
		
		ДокументОснованиеСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ДокументОснование);
		
		Если Не SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылкаДокумента(ДокументОснованиеСсылка) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Документ основание должен быть типом документ'"), , 
				"Объект.ДокументОснование", , Отказ);
		ИначеЕсли ЭтоНовый() И Не ОбщегоНазначения.СсылкаСуществует(ДокументОснованиеСсылка) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ссылка документа основания не существует'"), , 
				"Объект.ДокументОснование", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьДублиИдентификаторовСтрок(ТабличнаяЧасть)
	
	Если ТабличнаяЧасть.Количество() > 0 Тогда
		
		ИдентификаторыСтрок = ТабличнаяЧасть.ВыгрузитьКолонку("ИдентификаторСтроки");
		Возврат ИдентификаторыСтрок.Количество() <> ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИдентификаторыСтрок).Количество();
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
